app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `karyawans`
select `saldo` from `karyawans` where `user_id` = 1 limit 1
select * from `pengajuan_cutis` where `user_id` = 1 and `status` in ('Pending', 'Accept')
---
    public function index()
    {
        return view('dashboard.dashboard', [
            'title' => 'Dashboard',
            'pegawai' => Karyawan::count(),
            'saldo' => Karyawan::where('user_id', Auth()->user()->id)->value('saldo'),
            'list' => PengajuanCuti::where('user_id', Auth()->user()->id)->whereIn('status', ['Pending', 'Accept'])
                ->get()

select * from `pengajuan_cutis` where `status` = 'Pending'
---
    function listpengajuan()
    {
        Auth()->user()->unreadNotifications->markAsRead();
        return view('dashboard.pengajuancuti.list', [
            'title' => 'List Pengajuan Cuti',
            'list' => PengajuanCuti::where('status', 'Pending')->get()
        ]);

select * from `pengajuan_cutis` where `user_id` = 2
---
    function riwayatpengajuan()
    {
        Auth()->user()->unreadNotifications->markAsRead();
        return view('dashboard.pengajuancuti.riwayat', [
            'title' => 'Riwayat Pengajuan Cuti',
            'list' => PengajuanCuti::where('user_id', Auth()->user()->id)->get()
        ]);

select * from `pengajuan_cutis` where `pengajuan_cutis`.`id` = '2' limit 1
update `pengajuan_cutis` set `keterangan` = 'kamu tai', `status` = 'Reject', `pengajuan_cutis`.`updated_at` = '2024-04-14 04:23:12' where `id` = 1
select * from `roles` where `name` = 'Karyawan' limit 1
select * from `users` where `users`.`id` = 5 limit 1
---
    public function ubah_status(Request $request, $id)
    {
        $validator = $request->validate([
            'status' => 'required',
            'keterangan' => ''
        ]);
        $pengajuancuti = PengajuanCuti::findOrFail($id);
        $pengajuancuti->update($validator);
        $pengajuancutiUser = $pengajuancuti->user;
        $Role = Role::where('name', 'Karyawan')->first();

        $karyawan = $Role->users()->where('id', $pengajuancutiUser->id)->first();