app/Http/Controllers/JabatanController.php

    public function index()
    {
        return view('dashboard.jabatan.index', [
            'title' => 'Data Jabatan',
            'jabatan' => Jabatan::all()
---
select * from `jabatans`