app/Http/Controllers/JenisCutiController.php

select * from `jenis_cutis`
---
    public function index()
    {
        return view('dashboard.jeniscuti.index', [
            'title' => 'Data Jenis Cuti',
            'jeniscuti' => JenisCuti::all()