app/Http/Controllers/KaryawanController.php

select * from `jabatans`
select * from `karyawans`
---
    public function index()
    {
        return view('dashboard.karyawan.index', [
            'title' => 'Data Karyawan',
            'karyawan' => Karyawan::all(),
            'jabatans' => Jabatan::all()
        ]);

insert into `users` (`nama`, `email`, `password`, `updated_at`, `created_at`) values ('asep asep', 'asep@gmail.com', '$2y$12$xsCIyjRnNY3S3sGnY5meCOVoLPPnqivxwHfZhtCXzDB.5ssLM8Gnu', '2024-04-14 04:06:04', '2024-04-14 04:06:04')
select * from `users`
insert into `karyawans` (`n_depan`, `n_belakang`, `jabatan_id`, `no_hp`, `alamat`, `user_id`, `updated_at`, `created_at`) values ('asep', 'asep', '1', '8520', 'sasdf', 5, '2024-04-14 04:06:04', '2024-04-14 04:06:04')
---
    public function store(Request $request)
    {
        $data = [
            'nama' => $request->n_depan . ' ' . $request->n_belakang,
            'email' => $request->n_depan . '@gmail.com',
            'level' => $request->jabatan_id,
            'password' => bcrypt($request->n_depan),
            'email_verified_at' => now()
        ];
        dd($data);
        User::create($data);

        $validator = $request->validate([
            'n_depan' => 'required',
            'n_belakang' => 'required',
            'jabatan_id' => 'required',
            'n_hp' => 'required',
            'alamat' => 'required',
        ]);

        $a = User::all()->last();
        $validator['user_id'] = $a->id;

        Karyawan::create($validator);