app/Http/Controllers/PengajuanCutiController.php

select * from `jenis_cutis`
---
    public function index()
    {
        return view('ui-karyawan.pengajuan.index', [
            'title' => 'Data Pengajuan Cuti/Izin',
            'jcuti' => JenisCuti::all(),

select * from `karyawans` where `user_id` = 5 limit 1
update `karyawans` set `saldo` = 11, `karyawans`.`updated_at` = '2024-04-14 04:15:01' where `id` = 1
---
    public function store(Request $request)
    {
        $user_id = auth()->user()->id;
        $karyawan = Karyawan::where('user_id', $user_id)->firstOrFail();
        $saldocuti = $karyawan->saldo;

        if ($saldocuti <= 0) {
            return redirect('/dashboard/pengajuan-cuti')->with('error', 'Saldo Cuti Tidak Mencukupi');
        }

        // Kurangi saldo cuti sebelum memperbarui data karyawan
        $karyawan->saldo--;

        // Simpan perubahan saldo cuti pada data karyawan
        $karyawan->save();

insert into `pengajuan_cutis` (`jeniscuti_id`, `k_cuti`, `catatan`, `surat`, `tgl_mulai`, `tgl_selesai`, `status`, `user_id`, `updated_at`, `created_at`) values ('1', 'Cuti Tahunan', 'asdf', '17130681023.PDF', '2024-04-14', '2024-04-16', 'Pending', 5, '2024-04-14 04:15:02', '2024-04-14 04:15:02')
select * from `roles` where `name` = 'Admin' limit 1
---
        $validator['status'] = 'Pending';
        $validator['karyawan_id'] = $karyawan->id;

        $pengajuancuti = PengajuanCuti::create($validator);
        $adminRole = Role::where('name', 'HRD')->first();