app/Http/Controllers/UserController.php

    public function index()
    {
        return view('dashboard.user.index', [
            'title' => 'User Management',
            'user' => User::paginate(5),
            'roles' => Role::all()
        ]);
---
select * from `users`
select * from `roles`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'nama' => 'required|max:255',
            'email' => 'required|unique:users',
            'password' => 'required|max:255'
        ]);

        $validatedData['password'] = Hash::make($validatedData['password']);

        $user = User::create($validatedData);
---
insert into `users` (`nama`, `email`, `password`, `updated_at`, `created_at`) values ('rian', 'rian@gmail.com', '$2y$12$.qqOaC8fDw6v8gNHOV9kIejxhZEduhTcZTiOm1BJAZK5uF4BrLY0W', '2024-04-14 02:55:04', '2024-04-14 02:55:04')

    public function update(Request $request,  $id)
    {
        $validator = $request->validate([
            'nama' => 'required|max:255',
            'email' => 'required',
            'password' => 'nullable|min:2'
        ]);
        if ($request->filled('password')) {
            $validator['password'] = Hash::make($validator['password']);
        } else {
            // Jika password tidak diisi, hapus password dari array validator
            unset($validator['password']);
        }


        try {
            $user = User::findOrFail($id);
            $user->roles()->detach();
            $user->update($validator);
---
select * from `users` where `users`.`id` = '4' limit 1
update `users` set `password` = '$2y$12$VB.0wv.p/9qNk4XFteoK0OuZchpGi/q2Vriv77JS1Uz1dCgWzB3Lu', `users`.`updated_at` = '2024-04-14 03:27:40' where `id` = 4

    public function destroy($id)
    {
        $user = User::findOrFail($id);
        $pengajuanCuti = PengajuanCuti::where('user_id', $id)->get();
        try {
            User::destroy($user->id);
---
select * from `users` where `users`.`id` = '4' limit 1
select * from `pengajuan_cutis` where `user_id` = '4'
delete from `users` where `id` = 4